urlshorten/app/models/shortened_url.rb

INSERT INTO "shortened_urls" ("long_url", "short_url", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
    def self.create_short_url(user, long_url)