urlshorten/app/models/visit.rb

INSERT INTO "visits" ("user_id", "url_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 8], ["url_id", 6], ["created_at", "2019-03-27 22:41:14.777702"], ["updated_at", "2019-03-27 22:41:14.777702"]]
---
    def self.record_visit!(user, shortened_url)
        Visit.create!(user_id: user.id, url_id: shortened_url.id)